Documents/НачислениеЗаработнойПлатыСторнирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗаработнойПлатыСторнирование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ОсновныеНачисленияСторнирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГрафика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновноеНачислениеСторнирование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПлановыеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеУдержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеУдержания</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияРаботников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеЗаработнойПлатыСторнирование/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	// Вставить содержимое обработчика.
	
	Заполнять = Истина;
	Если Объект.Начисления.Количество()>0 ИЛИ Объект.Удержания.Количество()>0 ИЛИ Объект.ДополнительныеНачисления.Количество()>0 Тогда
		Если Вопрос("Очистить табличные части?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Заполнять = Истина;
		Иначе
			Заполнять = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если Заполнять Тогда
		ЗаполнитьНаСервере();
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	ЗаполнитьНачисления();
	ЗаполнитьДопНачисления();
	ЗаполнитьУдержания();

КонецПроцедуры // ЗаполнитьНаСервере()


&НаСервере
Процедура ЗаполнитьНачисления()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПлановыеНачисленияСрезПоследних.Сотрудник,
	               |	ПлановыеНачисленияСрезПоследних.Подразделение,
	               |	ПлановыеНачисленияСрезПоследних.ВидРасчета,
	               |	ПлановыеНачисленияСрезПоследних.Значение,
	               |	&НачалоПериода КАК Период
	               |ПОМЕСТИТЬ ТаблицаНачислений
	               |ИЗ
	               |	РегистрСведений.ПлановыеНачисления.СрезПоследних(&НачалоПериода, ) КАК ПлановыеНачисленияСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПлановыеНачисления.Сотрудник,
	               |	ПлановыеНачисления.Подразделение,
	               |	ПлановыеНачисления.ВидРасчета,
	               |	ПлановыеНачисления.Значение,
	               |	ПлановыеНачисления.Период
	               |ИЗ
	               |	РегистрСведений.ПлановыеНачисления КАК ПлановыеНачисления
	               |ГДЕ
	               |	ПлановыеНачисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНачислений.Сотрудник,
	               |	ТаблицаНачислений.Подразделение,
	               |	ТаблицаНачислений.ВидРасчета,
	               |	ТаблицаНачислений.Значение,
	               |	ТаблицаНачислений.Период,
	               |	МИНИМУМ(ЕСТЬNULL(ТаблицаНачислений1.Период, &КонецПериода)) КАК Период1
	               |ПОМЕСТИТЬ ТаблицаПериоды
	               |ИЗ
	               |	ТаблицаНачислений КАК ТаблицаНачислений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНачислений КАК ТаблицаНачислений1
	               |		ПО ТаблицаНачислений.Сотрудник = ТаблицаНачислений1.Сотрудник
	               |			И ТаблицаНачислений.Подразделение = ТаблицаНачислений1.Подразделение
	               |			И ТаблицаНачислений.ВидРасчета = ТаблицаНачислений1.ВидРасчета
	               |			И ТаблицаНачислений.Период < ТаблицаНачислений1.Период
	               |ГДЕ
	               |	ТаблицаНачислений.Значение > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаНачислений.Сотрудник,
	               |	ТаблицаНачислений.Подразделение,
	               |	ТаблицаНачислений.ВидРасчета,
	               |	ТаблицаНачислений.Период,
	               |	ТаблицаНачислений.Значение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаботникиОрганизацийСрезПоследних.Сотрудник,
	               |	РаботникиОрганизацийСрезПоследних.Подразделение,
	               |	РаботникиОрганизацийСрезПоследних.ТипГрафика,
	               |	&НачалоПериода КАК Период
	               |ПОМЕСТИТЬ РаботникиНаНачалоПериода
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, ) КАК РаботникиОрганизацийСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	               |	РаботникиОрганизаций.Сотрудник,
	               |	РаботникиОрганизаций.Подразделение,
	               |	РаботникиОрганизаций.ТипГрафика
	               |ПОМЕСТИТЬ РаботникиЗаПериод
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	               |ГДЕ
	               |	РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаботникиОрганизаций.Сотрудник,
	               |	РаботникиОрганизаций.Подразделение,
	               |	РаботникиОрганизаций.ТипГрафика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаботникиНаНачалоПериода.Сотрудник,
	               |	РаботникиНаНачалоПериода.Подразделение,
	               |	РаботникиНаНачалоПериода.ТипГрафика,
	               |	РаботникиНаНачалоПериода.Период
	               |ПОМЕСТИТЬ РаботникиНеСгруппированные
	               |ИЗ
	               |	РаботникиНаНачалоПериода КАК РаботникиНаНачалоПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РаботникиЗаПериод.Сотрудник,
	               |	РаботникиЗаПериод.Подразделение,
	               |	РаботникиЗаПериод.ТипГрафика,
	               |	РаботникиЗаПериод.Период
	               |ИЗ
	               |	РаботникиЗаПериод КАК РаботникиЗаПериод
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаботникиНеСгруппированные.Сотрудник,
	               |	РаботникиНеСгруппированные.Подразделение,
	               |	МАКСИМУМ(РаботникиНеСгруппированные.ТипГрафика) КАК ТипГрафика,
	               |	МАКСИМУМ(РаботникиНеСгруппированные.Период) КАК Период
	               |ПОМЕСТИТЬ РаботникиСгруппированные
	               |ИЗ
	               |	РаботникиНеСгруппированные КАК РаботникиНеСгруппированные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаботникиНеСгруппированные.Сотрудник,
	               |	РаботникиНеСгруппированные.Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПериоды.Сотрудник КАК Сотрудник,
	               |	ТаблицаПериоды.Подразделение КАК Подразделение,
	               |	ТаблицаПериоды.ВидРасчета,
	               |	ТаблицаПериоды.Значение КАК Размер,
	               |	ТаблицаПериоды.Период КАК ДатаНачала,
	               |	МАКСИМУМ(ТаблицаПериоды.Период1) КАК ДатаОкончания,
	               |	РаботникиСгруппированные.ТипГрафика
	               |ИЗ
	               |	ТаблицаПериоды КАК ТаблицаПериоды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РаботникиСгруппированные КАК РаботникиСгруппированные
	               |		ПО ТаблицаПериоды.Сотрудник = РаботникиСгруппированные.Сотрудник
	               |			И ТаблицаПериоды.Подразделение = РаботникиСгруппированные.Подразделение
	               |			И ТаблицаПериоды.Период <= РаботникиСгруппированные.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаПериоды.Сотрудник,
	               |	ТаблицаПериоды.Подразделение,
	               |	ТаблицаПериоды.ВидРасчета,
	               |	ТаблицаПериоды.Период,
	               |	ТаблицаПериоды.Значение,
	               |	РаботникиСгруппированные.ТипГрафика
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	ДатаНачала
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	
	Объект.Начисления.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры // ЗаполнитьНачисления()

&НаСервере
Процедура ЗаполнитьУдержания()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПлановыеУдержанияСрезПоследних.Сотрудник,
	               |	ПлановыеУдержанияСрезПоследних.Подразделение,
	               |	ПлановыеУдержанияСрезПоследних.ВидРасчета,
	               |	ПлановыеУдержанияСрезПоследних.Значение КАК Размер,
	               |	&НачалоПериода КАК Период
	               |ПОМЕСТИТЬ Удержания
	               |ИЗ
	               |	РегистрСведений.ПлановыеУдержания.СрезПоследних(&НачалоПериода, ) КАК ПлановыеУдержанияСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПлановыеУдержания.Сотрудник,
	               |	ПлановыеУдержания.Подразделение,
	               |	ПлановыеУдержания.ВидРасчета,
	               |	ПлановыеУдержания.Значение,
	               |	ПлановыеУдержания.Период
	               |ИЗ
	               |	РегистрСведений.ПлановыеУдержания КАК ПлановыеУдержания
	               |ГДЕ
	               |	ПлановыеУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Удержания.Сотрудник КАК Сотрудник,
	               |	Удержания.Подразделение КАК Подразделение,
	               |	Удержания.ВидРасчета,
	               |	Удержания.Размер
	               |ИЗ
	               |	Удержания КАК Удержания
	               |ГДЕ
	               |	Удержания.Размер > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Удержания.Подразделение,
	               |	Удержания.ВидРасчета,
	               |	Удержания.Сотрудник,
	               |	Удержания.Размер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	Подразделение
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	
	Объект.Удержания.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры // ЗаполнитьНачисления()
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьДопНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник,
		|	РаботникиОрганизацийСрезПоследних.Подразделение,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисления.Премия) КАК ВидРасчета
		|ПОМЕСТИТЬ Работники
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, ) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Состояние = &Состояние
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Подразделение,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисления.Премия)
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РаботникиОрганизаций.Состояние = &Состояние
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Сотрудник,
		|	Работники.Подразделение,
		|	Работники.ВидРасчета,
		|	&НачалоПериода КАК БазовыйПериодНачало,
		|	&КонецПериода КАК БазовыйПериодКонец
		|ИЗ
		|	Работники КАК Работники";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияРаботников.Работает );
	Объект.ДополнительныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры // ЗаполнитьДопНачисления()
